balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16F1947.PIC
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="SEG8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="INT"/>
      <edc:VirtualPin edc:name="SRI"/>
      <edc:VirtualPin edc:name="FLT0"/>
      <edc:VirtualPin edc:name="SEG30"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="SS2"/>
      <edc:VirtualPin edc:name="SEG7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="P1B" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="SEG6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="SDI2"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="P1C" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="SEG5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="SDO2"/>
      <edc:VirtualPin edc:name="P3B" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="SEG4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="P3C" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="SEG3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="P2B" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="SEG2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="P2C" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="SEG1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="P2D" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="SEG0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="RE7"/>
      <edc:VirtualPin edc:name="CCP2" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="P2A" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="SEG31"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="RE6"/>
      <edc:VirtualPin edc:name="P1B" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="COM3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="P1C" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="COM2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="P3B" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="COM1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="P3C" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="COM0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="P2B" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="VLCD3"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>